"""Задача A спринта 13 hash.

Сломай меня.
Гоша написал программу, которая сравнивает строки исключительно по их хешам.
Если хеш равен, то и строки равны. Тимофей увидел это безобразие
и поручил вам сломать программу Гоши, чтобы остальным неповадно было.

В этой задаче вам надо будет лишь найти две различные строки,
которые для заданной хеш-функции будут давать одинаковое значение.

Гоша использует следующую хеш-функцию:
h(s) = (s1*a^(n-1) + s2*a^(n-2) + ... + sn) % m
для a = 1000 и m = 123 987 123.
В данной задаче необходимо использовать в качестве значений отдельных символов
их коды в таблице ASCII.


'a' = 97 .. 'z' = 122
97*1000+97 = 97097
97097*1000+97 = 97_097_097

m = 123_987_123 = 3 * 3 * 13 * 409 * 2591
97097097097097 = 31 * 41 * 97 * 271 * 2906161
97097097097097 % 123_987_123 = 53359091 = 31 * 1721261

97097097097098 = 2 * 3^3 * 7 * 256870627241
97097097097098 % 53359092 = 2^2 * 3^2 * 911 * 1627

98097097097097 = 3^3 * 7 * 519032259773
98097097097097 % 53359092 = 37616526 = 2 * 3^2 * 2089807


ezhgeljkablzwnvuwqvp
101122104103101108106107097098108122119110118117119113118112
    = 2^5 * 7 * 1703323 * 32172652685727258844591 * 8237856034494470073238416191

gbpdcvkumyfxillgnqrv
103098112100099118107117109121102120105108108103110113114118
    = 2 * 43 * 673 * 3569521 * 499030690792344732590887187328523583524643770361

47021983 = 17 * 211 * 13109

i1 = a1 * k1 + r
i2 = a2 * k2 + r

"""
K_CHARS = ord('z') - ord('a') + 1
A = 1000
M = 123_987_123


def h(s: str, a: int, m: int):
    result = 0
    for si in s:
        result = (result * a + ord(si)) % m
    return result


def get_chars():
    tmp_hash = dict()
    k_variant = 0
    while True:
        i_var = k_variant
        word = ''
        while True:
            i_var, remainder = divmod(i_var, K_CHARS)
            word += chr(97 + remainder)
            if i_var == 0:
                break
        hash = h(word, A, M)
        if hash in tmp_hash:
            return word, tmp_hash[hash], hash
        tmp_hash[hash] = word
        # print(k_variant, hash, word)
        k_variant += 1


def main():
    """Главная программа."""
    # word1, word2, hash = get_chars()
    word1, word2 = 'ahoes', 'ab'
    print(word1)
    print(word2)
#    print(h(word1, A, M), h(word2, A, M))





if __name__ == '__main__':
    main()
